// Задача 29: Напишите программу:
// 1. которая задаёт массив из 8 элементов
// 2. и выводит их на экран.


// 1, 2, 5, 7, 19 -> [1, 2, 5, 7, 19]
// 6, 1, 33 -> [6, 1, 33]

int[] creatArray(int size)
{

}

Console.WriteLine()