// Задача 27: Напишите программу:
// 1. которая принимает на вход число
// 2. и выдаёт сумму цифр в числе.

// 452 -> 11
// 82 -> 10
// 9012 -> 12

Console.WriteLine("Введите число: ");
int number = Convert.ToInt32(Console.ReadLine());

int SumOfDigit(int num)
{

}